Repository: hsugawa8651/juliadoc-trans-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: By extending a few specific methods to work for a custom type, objects of that type not only receive those functionalities, but they are also able to be used in other methods that are written to generically build upon those behaviors.
ja: カスタムタイプで作業するためのいくつかの特定の方法を拡張することによって、そのタイプのオブジェクトは、以下のように表示されます。 これらの機能を受け取りますが、他の方法で書かれることもあります。 一般的に構築されています。

source: By pushing an environment containing these tools onto the load path, you immediately have access to them in top-level code without needing to add them to your project.
ja: これらのツールを含む環境をロードパスにプッシュすることによって、それらをプロジェクトに追加する必要なしに、トップレベルコードですぐにアクセスすることができます。

source: By putting the `@views` macro in front of an expression or block of code, any array[...] slice in that expression will be converted to create a SubArray view instead.
ja: `@views'マクロを式の前に置くか コードのブロック、任意の配列[.]スライスは、その式の中に変換されます。 代わりにサブアレイを作成ビューを作成します。

source: By the IEEE 754 standard, these floating-point values are the results of certain arithmetic operations:
ja: IEEE754規格のでは これらの浮動小数点値は、特定の算術演算の結果です。

source: Bypassing default machinery
ja: デフォルトのマシンをバイパスする

source: C MUST NOT modify the memory returned via Ref{T} if T is an isbits type
ja: は、Tがイスビトス<x×>で返されるメモリを変更してはならない。は、の場合である。

source: C name
ja: C名

source: Call C functions directly (no wrappers or special APIs needed)
ja: ラッパーや特別なAPIを必要としない、Cの関数の直接の呼び出し

source: Callees must make explicit copies to ensure that they don't modify inputs that they don't intend to change.
ja: 呼び出し側は、入力を変更しないことを確実にするために、明示的なコピーを作成する必要があります。 変化するつもりはありません。

source: Calling Convention
ja: 通話条約

source: Calling any function that is defined after the body of the generated function.
ja: 生成された関数のボディの後に定義された関数を呼び出します。

source: Calls
ja: 関数呼び出し

source: Can I use using or import inside a function?
ja: 関数の中でまたはインポートを使用して、を使用することはできますか?

source: Captured variables can create performance challenges as discussed in (@ref man-performance-tips).
ja: キャプチャされた変数 (@ref man-performance-tipsで説明されているように、パフォーマンス・チャレンジを作成することができます。

source: Captured variables can present performance challenges; see (@ref man-performance-tips).
ja: キャプチャされた変数はパフォーマンス上の問題を提示することがあります。 (@ref man-performance-tips。

source: Cartesian indices
ja: デカルト指数

source: Case Study: Rational
ja: ケーススタディ:合理的

source: Category
ja: カテゴリ

source: Chained comparisons use the && operator for scalar comparisons, and the `&` operator for elementwise comparisons, which allows them to work on arrays.
ja: 連続した比較は、スカラー比較に&& 演算子を使用し、 要素単位（elementwiseの比較では配列処理を行う `&` 演算子を使用します。

source: Chaining comparisons
ja: 連鎖比較

source: Chaining comparisons is often quite convenient in numerical code.
ja: 連続した比較は、数値コードで便利です。

source: Cobra cannot depend on Aardvark or Bobcat since neither have real UUIDs.
ja: Cobraは、ツチブタまたはボブキャットに依存することはできません。どちらも実際のUUIDを持っていないためです。

source: Code inclusion is quite straightforward: it simply parses and evaluates a source file in the context of the caller.
ja: コードインクルージョンは非常に単純です。呼び出し元のコンテキストでソースファイルを解析し、評価するだけです。

source: Code inclusion: e.g. include("source.jl").
ja: コードインクルージョン:例えばは("source.jl")を含む。

source: Combining dot operators with numeric literals can be ambiguous.
ja: ドット演算子と数値リテラルを組み合わせることは、あいまいです。

source: Common Operations
ja: 共通の演算

source: Compare how these results differ:
ja: これらの結果がどのように異なるかを比較します：

source: Comparison -- ==, !=, ≈ (`isapprox`), ≉
ja: 比較-==,!=,≒('('イサッポロス)≉

source: Comparisons
ja: 比較

source: Complex blocks:
ja: 複雑なブロック:

source: Composite types, aka struct in C or TYPE in Fortran90 (or STRUCTURE / RECORD in some variants of F77), can be mirrored in Julia by creating a struct definition with the same field layout.
ja: Fortran90(或いは、いくつかの変形例においては、構造体in CまたはTYPE/RECORD(ある種の変数ではRECORD) は、同じ名前で構造体定義を作成することによって、ジュリアにミラーリングすることができます。 フィールドのレイアウトです。

source: Comprehension syntax is similar to set construction notation in mathematics:
ja: 理解の構文は次のとおりです。 数学で設定された建設表記法に似ています

source: Comprehensions
ja: 包含

source: Comprehensions can also be written without the enclosing square brackets, producing an object known as a generator.
ja: 包含は、囲まれた角括弧なしで書くこともでき、オブジェクトを生成することができます。 ジェネレータと呼ばれます。

source: Comprehensions can also be written without the enclosing square brackets, producing an object known as a generator. This object can be iterated to produce values on demand, instead of allocating an array and storing them in advance (see Iteration). For example, the following expression sums a series without allocating memory:
ja: 包含は、囲まれた角括弧なしで書くこともでき、オブジェクトを生成することができます。 ジェネレータと呼ばれます。このオブジェクトは、必要に応じて反復処理を行うことができます。必要に応じて値を割り当てることはできません。 配列とそれを事前に格納します(Iterationを参照)。たとえば、次の式を指定します。 は、メモリを割り当てずに連続した値を加算します。

source: Comprehensions provide a general and powerful way to construct arrays.
ja: 内包は、配列を構築するための一般的で強力な方法です。

source: Comprehensions provide a general and powerful way to construct arrays. Comprehension syntax is similar to set construction notation in mathematics:
ja: インクルージョンは、配列を構築するための一般的で強力な方法です。理解の構文は次のとおりです。 数学で設定された建設表記法に似ています

source: Concatenation
ja: 連結

source: Concatenation syntax can similarly be prefixed with a type to specify the element type of the result.
ja: 連結構文には、同じように 結果。

source: Conceptually, a string is a partial function from indices to characters: for some index values, no character value is returned, and instead an exception is thrown.
ja: 概念的には、文字列はインデックスから文字への部分的な関数partial functionです。インデックス値によっては文字列は返されず、例外が出力されます。

source: Conclusion
ja: 結論

source: Concrete types should also typically provide a `similar(A,T=eltype(A),dims=size(A))`
ja: 具体的には、典型的には、'類似の(A,T=エルテープ(A),dims=size(A))`を提供する必要があります。

source: Conditional evaluation allows portions of code to be evaluated or not evaluated depending on the value of a boolean expression.
ja: 条件付き評価は、コードの一部を評価することができます。 ブール式の値。

source: Consequently, specializing on DestType has lower precedence than methods that specialize on DestStyle.
ja: したがって、DestTypeに特化することは、以下の優先順位よりも優先順位が低くなります。 DestStyleに特化した方法。

source: Consider the following example project file for the hypothetical application, App, as described earlier:
ja: 前述のように、仮想アプリケーションAppについては、次のプロジェクト・ファイルを考慮してください。

source: Consider the following recursive type declaration:
ja: 次の再帰タイプ宣言を考慮してください。

source: Consider these examples of this syntax:
ja: この構文の例を次に示します。

source: Consider this example:
ja: 次の例を考慮してください。

source: Considered alone, this may seem relatively trivial; CartesianIndex simply gathers multiple integers together into one object that represents a single multidimensional index.
ja: 単独で考慮すると、これは比較的簡単であるように思えるかもしれません。CartesianIndexは単純です。 複数の整数を1つのオブジェクトに集約して1つのオブジェクトを作成します。 多次元インデックス。

source: Considered alone, this may seem relatively trivial; CartesianIndex simply gathers multiple integers together into one object that represents a single multidimensional index. When combined with other indexing forms and iterators that yield CartesianIndexes, however, this can produce very elegant and efficient code. See Iteration below, and for some more advanced examples, see this blog post on multidimensional algorithms and iteration.
ja: 単独で考慮すると、これは比較的簡単であるように思えるかもしれません。CartesianIndexは単純です。 複数の整数を1つのオブジェクトに集約して1つのオブジェクトを作成します。 多次元インデックス。他のインデックス作成フォームおよびイテレータと組み合わせて使用します。 しかし、それはCartesianIndexの収量をもたらすが、これは非常にエレガントなものである。 そして、効率的なコードがあります。Iterationを参照してください。 例を参照してください。このブログ記事は、多次元アルゴリズムに関するこのブログ記事を参照してください。 繰り返し。

source: Constructing infinite rational values is acceptable:
ja: 無限有理値の構築は許容されます。

source: Constructing strings using concatenation can become a bit cumbersome, however.
ja: しかしながら、連結を使って文字列を構成するのは少々扱いにくくなってしまうかもしれません。

source: Construction and Initialization
ja: 建設と初期化

source: Constructors exist to create these types from primitive numerical types, and `parse()`
ja: コンストラクタは数値プリミティブ型からこれらの型を生成し、`parse()`は AbstractStringから これらの型を生成する際に使用できます。

source: Constructors exist to create these types from primitive numerical types, and `parse`
ja: コンストラクタはプリミティブな数値型からこれらのタイプを作成するために存在します。`parse'

source: Control flow
ja: 制御フロー

source: Control whether inlining is permitted, including overriding @inline declarations
ja: @inline宣言の上書きを含め、インライン化が許可されているかどうかを制御する

source: Conversion from rational to floating-point respects the following identity for any integral values of a and b, with the exception of the case a == 0 and b == 0:
ja: 有理から浮動小数点への変換は、すべての積分値について次の識別を反映します。 aとbは例外であり、<x×>a==0、b==0の例外を除く。

source: Convert x to an object that has axes and supports indexing
ja: xを軸を持つオブジェクトに変換して、インデックスを作成します。

source: Converting to a Cstring as part of the `ccall` checks for contained NUL bytes and could therefore throw a conversion error.
ja: 変換する Cstringは、含まれるNULバイトを'ccallチェックの一部としてにします。したがって 変換エラーをスローします。

source: Converting a linear index to multiple indexing subscripts is typically very expensive, so this provides a traits-based mechanism to enable efficient generic code for all array types.
ja: リニアインデックスを複数のインデックス添字に変換することは、一般的に非常に高価です。したがって、次のようになります。 は、すべての配列タイプに対して効率的な汎用コードを有効にするための属性ベースのメカニズムを提供します。

source: Core operations typically have dozens of methods:
ja: 中心となる演算には通常数十種類のメソッドがあります:

source: Count bytes allocated by each source line
ja: 各ソース行によって割り当てられたカウントバイト数

source: Count executions of source lines
ja: ソース行の実行数のカウント

source: Creating C-Compatible Julia Function Pointers
ja: C互換性のあるJulia関数ポインタの作成

source: Creation of a variable named where, in or isa is allowed though.
ja: は、はisaではであるが、はである。

source: Cstring type here: as the array is uninitialized, it could contain NUL bytes.
ja: ここではCstringタイプです:配列は初期化されていないので、NULバイトを含むことができます。

source: Cstring type here: as the array is uninitialized, it could contain NUL bytes. Converting to a Cstring as part of the `ccall` checks for contained NUL bytes and could therefore throw a conversion error.
ja: Cstringタイプ:配列は初期化されていないため、NULバイトを含むことができます。変換 Cstringは、含まれるNULバイトを'ccallチェックの一部としてにします。したがって 変換エラーをスローします。

source: Currently, only the platform-default C calling convention is supported.
ja: 現在、プラットフォームのデフォルトのC呼び出し規約のみがサポートされています。

source: Currently, only the platform-default C calling convention is supported. This means that @cfunction-generated pointers cannot be used in calls where WINAPI expects stdcall
ja: 現在、プラットフォームのデフォルトのC呼び出し規則のみがサポートされています。これは、次のことを意味します。 @cfunction-生成されたポインタは、WINAPIがstdcallを想定している呼び出しでは使用できません。

source: Currently, this is only supported for primitive types or other pointer-free (isbits) immutable struct types.
ja: 現在では、これはプリミティブ型または他のポインタフリー(イスビトス)の不変構造型タイプでのみサポートされています。

source: Custom implementation of broadcast!, specializing on DestStyle
ja: ブロードキャストのカスタム実装!DestStyleを専門にしています。<x/>

source: Custom implementation of broadcast!, specializing on DestType
ja: ブロードキャストのカスタム実装!DestTypeを専門にしています。<x/>

source: Custom implementation of broadcast
ja: ブロードキャストのカスタム実装

source: Custom types can similarly specialize Base.broadcastable to define their shape, but they should follow the convention that collect(Base.broadcastable(x)) == collect(x).
ja: カスタム・タイプも同様に特殊化できます。 <X21/>Base.broadcastableのシェイプを定義するには、次の規則に従う必要があります。 collect(Base.broadcastable(x))==collect(x)。

source: Cvoid (this will return the singleton instance nothing::Cvoid)
ja: Cvoid(これはシングルトンインスタンスなし:Cvoidを返します)

source: Date and DateTime
ja: 日付と日時

source: Declaration of the indices of x for broadcasting purposes (defaults to `axes(x)`)
ja: xのインデックスを`axes(x)`に従って宣言する。

source: Declaration of the indices of x, as per `axes(x)`.
ja: xの指数をの軸(x)に従って宣言する。

source: Default definition
ja: デフォルト定義

source: DefaultArrayStyle "loses" to any other AbstractArrayStyle that has been defined because of the following methods:
ja: DefaultArrayStyle"は他のすべてに"失われます" AbstractArrayStyleは、以下の方法により定義されている。

source: Define a function f(x), which initially has one method:
ja: 最初は1つのメソッドを持つ関数f(x)を定義します。

source: Define these two functions for custom types to override how they are stored in a hash table.
ja: これらを定義する ハッシュテーブルに格納される方法を上書きするカスタムタイプ用の2つの関数。

source: Defining similar, getindex and setindex! for SparseArray also makes it possible to `copy` the array:
ja: 類似のを定義し、getindexを定義します。 setindex!SparseArrayは、'コピーを可能にします。

source: DenseArray is an abstract subtype of AbstractArray intended to include all arrays where elements are stored contiguously in column-major order (see additional notes in (@ref man-performance-tips)).
ja: DenseArrayは、すべての配列を含むことを意図したAbstractArrayの抽象サブタイプである。 要素は列主順序で連続的に格納されます(追加の注記を参照してください)。 (@ref man-performance-tips)。

source: DenseArray is an abstract subtype of AbstractArray intended to include all arrays where elements are stored contiguously in column-major order (see additional notes in (@ref man-performance-tips)). The `Array` type is a specific instance of DenseArray; `Vector` and `Matrix` are aliases for the 1-d and 2-d cases. Very few operations are implemented specifically for Array beyond those that are required for all AbstractArrays; much of the array library is implemented in a generic manner that allows all custom arrays to behave similarly.
ja: DenseArrayは、すべての配列を含むことを意図したAbstractArrayの抽象サブタイプである。 要素は列主順序で連続的に格納されます(追加の注記を参照してください)。 (@ref man performance tips).'Array`typeは特定のインスタンスです。 DenseArray;'Vector'および'Matrix'は、1-dおよび2-dケースのエイリアスです。 アレイに対しては、必要な動作を超えて実装されているオペレーションはほとんどありません。 すべてのAbstractArray;アレイライブラリの多くは一般的に実装されています。 すべてのカスタム・アレイが同じように動作するようにする方法です。

source: Depending on your needs, you can either ignore these complexities entirely and just pretend that only ASCII characters exist, or you can write code that can handle any of the characters or encodings that one may encounter when handling non-ASCII text.
ja: あなたの必要に応じて、これらの複雑な問題を気にせずASCII文字だけを使用したり、非ASCIIテキストを扱う際に 見かける様々な文字やエンコードを使用したコードを書くことができます。

source: Description
ja: 説明

source: Designed for parallelism and distributed computation
ja: 並列コンピューティング・分散コンピューティングを意図した設計

source: Despite their implementation differences, these operations all fall under the general concept of "addition".
ja: 実装が違っていても、これらの操作はすべて、一般的な概念の「足し算」に当てはまります。.

source: Dictionaries may also be created with generators.
ja: 辞書はジェネレータで作成することもできます。

source: Different entities may use the same name to refer to unrelated packages.
ja: 異なるエンティティは、無関係パッケージを参照するために同じ名前を使用することがある。

source: Dingo cannot import anything because it has a project file without a [deps] section.
ja: ディンゴは、[deps]セクション以外のプロジェクトファイルを持っているため、何もインポートできません。

source: Direct comparison of the numerator and denominator is generally not necessary, since the standard arithmetic and comparison operations are defined for rational values:
ja: 分子と分母の直接比較は、一般的には必要ではないので、一般的には必要ではない。 算術演算と比較演算は、有理値に対して定義されます。

source: Direct construction of Expr objects with value arguments is powerful, but Expr constructors can be tedious compared to "normal" Julia syntax.
ja: 値引数を持つExprオブジェクトの直接構築は強力ですが、Exprコンストラクタは強力です。 は、「通常の」ジュリア構文と比較して、退屈である可能性があります。

source: Disallow or enable unsafe floating point optimizations (overrides @fastmath declaration)
ja: 安全でない浮動小数点の最適化を許可または有効にします@fastmath宣言を無効にします)。

source: Display version information
ja: バージョン情報を表示する

source: Division errors
ja: 除算エラー

source: Division functions
ja: 除算関数

source: Do not try to free an object received from a C library with `Libc.free` in Julia, as this may result in the free function being called via the wrong libc library and cause Julia to crash.
ja: 次の操作を実行しないでください。 は、<x/>Libc.freeを含むCライブラリから受信されたオブジェクトで、フリー関数を生成する可能性がある 間違ったlibcライブラリを介して呼び出され、ジュリアがクラッシュすることがあります。

source: Do not use `end`in indexing expressions that may contain either `CartesianIndex` or arrays thereof.
ja: 「CartesianIndex」またはその配列が含まれる可能性のある表現のインデックス作成には「end」を使用しないでください。

source: Do not use this for functions that return no value (void) but do return, use Cvoid instead.
ja: 値を返さない関数にはこれを使用しない (void)しかし、リターンする場合は、Cvoidを使用してください。

source: Documentation
ja: ドキュメントの作成

source: Download and install Julia by following the instructions at http://julialang.org/downloads/.
ja: http://julialang.org/downloads/ にある手順に従い、Juliaをダウンロードしてインストールしてください。

source: Download and install Julia by following the instructions at https://julialang.org/downloads/.
ja: http://julialang.org/downloads/ にある手順に従い、Juliaをダウンロードしてインストールしてください。

source: Each kind of environment defines these three maps differently, as detailed in the following sections.
ja: 各環境では、次のセクションで詳細に説明されているように、これら3つのマップを異なる方法で定義しています。

source: Each machine definition takes the form [count*][user@]host[:port] [bind_addr[:port]] .
ja: 各マシンの定義は [count*][user@]host[:port] [bind_addr[:port]]という形式で書かれます。

source: Each machine definition takes the form [count*][user@]host[:port] [bind_addr[:port]].
ja: 各マシンの定義は [count*][user@]host[:port] [bind_addr[:port]]という形式で書かれます。

source: Efficient support for Unicode, including but not limited to UTF-8
ja: Unicode の効率的なサポート。 UTF-8 も含みますが、これに限定しません

source: Either EltypeUnknown() or HasEltype() as appropriate
ja: EltypeUnknown()またはHasEltype()のいずれか適切な場合

source: Elegant and extensible conversions and promotions for numeric and other types
ja: 数値型他の型の、エレガントで拡張性のある変換やプロモーション [2]

source: Element type T must be able to hold these values, i.e. Nothing <: T.
ja: 要素型Tは、これらの値を保持できなければなりません。つまり、<:t7>Nothing<:Tです。

source: Elementary Functions
ja: 基本関数

source: Emit bounds checks always or never (ignoring declarations)
ja: 放出の境界チェックは常に行われる(宣言を無視する)

source: Empty arrays like [], which select no elements
ja: []のような空の配列で、要素は選択されません。

source: Empty ranges of the form n:n-1 are sometimes used to indicate the inter-index location between n-1 and n.
ja: n:n-1という形式の空の範囲は、場合によっては、インデックス間の位置を示すために使用される。 n-1およびn。

source: Empty ranges of the form n:n-1 are sometimes used to indicate the inter-index location between n-1 and n. For example, the `searchsorted` function uses this convention to indicate the insertion point of a value not found in a sorted array:
ja: n:n-1という形式の空の範囲は、場合によっては、インデックス間の位置を示すために使用される。 n-1とn。たとえば、'セアルチゾルタド'はこの表記法を使用します。 ソートされた配列に存在しない値の挿入点です。

source: Enable / Set the level of debug info generation (default level is 1 if unspecified or 2 if used without a level)
ja: デバッグ情報の生成レベルを有効/設定します(デフォルトレベルは、指定されていない場合は1、レベルなしでは2を指定します)。

source: Enable or disable Julia's default signal handlers
ja: ジュリアのデフォルトシグナルハンドラを有効または無効にする

source: Enable or disable color text
ja: カラーテキストを有効または無効にする

source: Enable or disable incremental precompilation of modules
ja: モジュールのインクリメンタル事前コンパイルを有効または無効にする

source: Enable or disable method overwrite warnings
ja: メソッドの上書き警告を有効または無効にする

source: Enable or disable startup banner
ja: 起動バナーを有効または無効にする

source: Enable or disable syntax and method deprecation warnings (error turns warnings into errors)
ja: 構文およびメソッドの非推奨警告を有効または無効にします((errorは警告をエラーに変換します)。

source: Ensuring that all arguments support broadcast
ja: すべての引数がブロードキャストをサポートすることを確認する

source: Environment stacks
ja: 環境スタック

source: Environments
ja: 環境

source: Evaluate
ja: を評価します。

source: Evaluating this expression yields an interpolated 3:
ja: この式を評価すると、補間された3が得られます。

source: Even beyond mathematical operations, however, multiple dispatch ends up being a powerful and convenient paradigm for structuring and organizing programs.
ja: しかし、数学的な操作以外でも、多重ディスパッチは、プログラムの構築し組織化する強力で便利なパラダイムです。

source: Every (@ref modules) has its own `eval` function that evaluates expressions in its global scope.
ja: (@refモジュール)はすべて、そのグローバルな表現を評価する独自の`eval'関数を持っています。 範囲。

source: Every C type also has a corresponding Julia type with the same name, prefixed by C. This can help for writing portable code (and remembering that an int in C is not the same as an Int in Julia).
ja: すべてのC型は同じ名前を冠した同じ名前を持つ、対応するジュリア型を持っています。 これは、移植可能なコードを書くのに役立ちます(そして、Cではintが同じではないことを思い出してください)。 のIntIntint。

source: Every Julia program starts life as a string:
ja: すべてのジュリアプログラムは文字列として始まります。

source: Every binary arithmetic and bitwise operator also has an updating version that assigns the result of the operation back into its left operand.
ja: 全ての二項演算子とビット単位の演算子には、被演算子の処理の結果を代入できる更新機能があります。

source: Everyday programming requires no direct usage of tasks, but certain problems can be solved much more easily by using tasks.
ja: 日常的なプログラミングでは タスクを直接使用することはできますが、タスクを使用することによって、特定の問題をより容易に解決することができます。

source: Exactly corresponds to the complex double type in C (or COMPLEX*16 in Fortran).
ja: 厳密には、Cの複合体二重型(Fortranの場合はCOMPLEX*16)に対応する。

source: Exactly corresponds to the complex float type in C (or COMPLEX*8 in Fortran).
ja: 厳密には、Cの複合floatタイプ(Fortranの場合はCOMPLEX*8)に対応しています。

source: Exactly corresponds to the double type in C (or REAL*8 in Fortran).
ja: 厳密には、Cのdouble型(Fortranの場合はREAL*8)に対応しています。

source: Exactly corresponds to the float type in C (or REAL*4 in Fortran).
ja: 厳密には、Cのfloatタイプ(Fortranの場合はREAL*4)に対応します。

source: Exactly corresponds to the signed type annotation in C (or any INTEGER type in Fortran).
ja: 厳密には、C(またはFortranでは任意のINTEGERタイプ)の署名された型の注釈に対応しています。

source: Exactly corresponds to the signed type annotation in C (or any INTEGER type in Fortran). Any Julia type that is not a subtype of `Signed` is assumed to be unsigned.
ja: 厳密には、C(またはFortranでは任意のINTEGERタイプ)の署名された型の注釈に対応しています。 '署名されたのサブタイプではないジュリア型は、符号なしであると仮定されます。

source: Example
ja: 例

source: Example:
ja: 例:

source: Exception Handling
ja: 例外処理

source: Exception Handling: try-catch, `error()` and `throw()`.
ja: 例外処理:try-catch`error()`と`throw()`。

source: Exception Handling: try-catch, `error` and `throw`.
ja: 例外処理:try-catch'エラー'''"。

source: Exceptions can be created explicitly with `throw`.
ja: 例外は、`throw'で明示的に作成することができます。

source: Existing code then seamlessly applies to the new data types.
ja: こうすることで、既存のコードをシームレスに新たなデータ型対応させることができます。

source: Explicitly, this means that:
ja: 明示的に つまり、次のようになります。

source: Exponentiation
ja: 累乗

source: Expr objects contain two parts:
ja: exprオブジェクトには、次の2つのパーツが含まれています。

source: Expr objects may also be nested:
ja: Exprオブジェクトはネストされている場合もあります。

source: Expr, which may look very familiar to users of Lisp.
ja: Expr。Lispのユーザには非常に馴染みのあるものです。

source: Expression
ja: 式

source: Expression interpolation allows convenient, readable programmatic construction of complex Julia expressions.
ja: 表現の補間により、便利で読み取り可能なプログラムが可能になります。 複雑なジュリア表現の構築。

source: Expressions and evaluation
ja: 式と評価

source: Expressions may also be constructed directly in prefix notation:
ja: 式は、プレフィックス表記で直接構築することもできます。

source: Expressions passed to `eval` are not limited to returning values -- they can also have side-effects that alter the state of the enclosing module's environment:
ja: `eval`に渡される式は、値を返すことに限定されるわけではありません--それらは値を返すことができます。 また、エンディングモジュールの環境の状態を変更する副作用もあります。

source: Expressions provided by the parser generally only have symbols, other expressions, and literal values as their args, whereas expressions constructed by Julia code can have arbitrary run-time values without literal forms as args.
ja: パーサーによって提供される式には、一般的にはシンボル、その他の表現、およびリテラルがあります。 値はargsとして、Juliaコードで構築された式は任意のランタイムを持つことができます。 引数としてリテラル・フォームを使用しない値。

source: Expressions starting with 0x are always hexadecimal literals.
ja: 0x で始まる式は、常に16進リテラルとして解釈されます。

source: Expressions starting with a numeric literal followed by e or E are always floating-point literals.
ja: e または Eが続く数値リテラルで始まる式は、浮動小数点リテラルとして解釈されます。

source: Expressions starting with a numeric literal followed by f are always 32-bit floating-point literals.
ja: 数値リテラルで始まり、<x x/>fが続く式は常に32ビット浮動小数点リテラルです。

source: Extended documentation for mathematical symbols & functions is (@ref math-ops).
ja: 数学的シンボルと関数の拡張ドキュメントは(@ref math ops)です。

source: Federated package management and precise software reproducibility are difficult but worthy goals in a package system.
ja: 連合パッケージ管理と正確なソフトウェア再現性は難しいが、パッケージ・システムでは価値のある目標である。

source: Federation of packages
ja: パッケージの連合

source: Finally, let's take a look at some more complex examples where this rule comes into play.
ja: 最後に、このルールが適用されるより複雑な例を、いくつか見てみましょう。

source: Finally, one should define a function display(d::D, x) that queries `showable(mime, x)` for the mime types supported by D
ja: 最後に、関数を定義する必要があります。 display(d::D, x)''showable(mime、x)`DDでサポートされているmimeの種類については、を参照してください。x28
